load-test-result-50vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/50 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 03/50 VUs  0m00.8s/1m40.0s

running (0m02.0s), 05/50 VUs, 44 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  0m01.8s/1m40.0s

running (0m03.0s), 07/50 VUs, 102 complete and 0 interrupted iterations
default   [   3% ] 07/50 VUs  0m02.8s/1m40.0s

running (0m04.0s), 10/50 VUs, 180 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  0m03.8s/1m40.0s

running (0m05.0s), 12/50 VUs, 280 complete and 0 interrupted iterations
default   [   5% ] 12/50 VUs  0m04.8s/1m40.0s

running (0m06.0s), 15/50 VUs, 406 complete and 0 interrupted iterations
default   [   6% ] 15/50 VUs  0m05.8s/1m40.0s

running (0m07.0s), 17/50 VUs, 550 complete and 0 interrupted iterations
default   [   7% ] 17/50 VUs  0m06.8s/1m40.0s

running (0m08.0s), 20/50 VUs, 716 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  0m07.8s/1m40.0s

running (0m09.0s), 22/50 VUs, 904 complete and 0 interrupted iterations
default   [   9% ] 22/50 VUs  0m08.8s/1m40.0s

running (0m10.0s), 25/50 VUs, 1113 complete and 0 interrupted iterations
default   [  10% ] 25/50 VUs  0m09.8s/1m40.0s

running (0m11.0s), 27/50 VUs, 1357 complete and 0 interrupted iterations
default   [  11% ] 27/50 VUs  0m10.8s/1m40.0s

running (0m12.0s), 30/50 VUs, 1611 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  0m11.8s/1m40.0s

running (0m13.0s), 32/50 VUs, 1887 complete and 0 interrupted iterations
default   [  13% ] 32/50 VUs  0m12.8s/1m40.0s

running (0m14.0s), 34/50 VUs, 2193 complete and 0 interrupted iterations
default   [  14% ] 34/50 VUs  0m13.8s/1m40.0s

running (0m15.0s), 37/50 VUs, 2515 complete and 0 interrupted iterations
default   [  15% ] 37/50 VUs  0m14.8s/1m40.0s

running (0m16.0s), 39/50 VUs, 2872 complete and 0 interrupted iterations
default   [  16% ] 39/50 VUs  0m15.8s/1m40.0s

running (0m17.0s), 42/50 VUs, 3236 complete and 0 interrupted iterations
default   [  17% ] 42/50 VUs  0m16.8s/1m40.0s

running (0m18.0s), 44/50 VUs, 3643 complete and 0 interrupted iterations
default   [  18% ] 44/50 VUs  0m17.8s/1m40.0s

running (0m19.0s), 47/50 VUs, 4052 complete and 0 interrupted iterations
default   [  19% ] 47/50 VUs  0m18.8s/1m40.0s

running (0m20.0s), 49/50 VUs, 4483 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  0m19.8s/1m40.0s

running (0m21.0s), 50/50 VUs, 4942 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m20.8s/1m40.0s

running (0m22.0s), 50/50 VUs, 5392 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m21.8s/1m40.0s

running (0m23.0s), 50/50 VUs, 5859 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m22.8s/1m40.0s

running (0m24.0s), 50/50 VUs, 6320 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m23.8s/1m40.0s

running (0m25.0s), 50/50 VUs, 6773 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  0m24.8s/1m40.0s

running (0m26.0s), 50/50 VUs, 7223 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m25.8s/1m40.0s

running (0m27.0s), 50/50 VUs, 7676 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m26.8s/1m40.0s

running (0m28.0s), 50/50 VUs, 8144 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m27.8s/1m40.0s

running (0m29.0s), 50/50 VUs, 8594 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m28.8s/1m40.0s

running (0m30.0s), 50/50 VUs, 9060 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m29.8s/1m40.0s

running (0m31.0s), 50/50 VUs, 9524 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m30.8s/1m40.0s

running (0m32.0s), 50/50 VUs, 9990 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m31.8s/1m40.0s

running (0m33.0s), 50/50 VUs, 10440 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m32.8s/1m40.0s

running (0m34.0s), 50/50 VUs, 10885 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  0m33.8s/1m40.0s

running (0m35.0s), 50/50 VUs, 11340 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  0m34.8s/1m40.0s

running (0m36.0s), 50/50 VUs, 11810 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  0m35.8s/1m40.0s

running (0m37.0s), 50/50 VUs, 12260 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m36.8s/1m40.0s

running (0m38.0s), 50/50 VUs, 12710 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  0m37.8s/1m40.0s

running (0m39.0s), 50/50 VUs, 13175 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m38.8s/1m40.0s

running (0m40.0s), 50/50 VUs, 13635 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  0m39.8s/1m40.0s

running (0m41.0s), 50/50 VUs, 14089 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  0m40.8s/1m40.0s

running (0m42.0s), 50/50 VUs, 14551 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  0m41.8s/1m40.0s

running (0m43.0s), 50/50 VUs, 15011 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  0m42.8s/1m40.0s

running (0m44.0s), 50/50 VUs, 15466 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  0m43.8s/1m40.0s

running (0m45.0s), 50/50 VUs, 15927 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  0m44.8s/1m40.0s

running (0m46.0s), 50/50 VUs, 16377 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  0m45.8s/1m40.0s

running (0m47.0s), 50/50 VUs, 16827 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  0m46.8s/1m40.0s

running (0m48.0s), 50/50 VUs, 17294 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  0m47.8s/1m40.0s

running (0m49.0s), 50/50 VUs, 17751 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  0m48.8s/1m40.0s

running (0m50.0s), 50/50 VUs, 18201 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  0m49.8s/1m40.0s

running (0m51.0s), 50/50 VUs, 18661 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  0m50.8s/1m40.0s

running (0m52.0s), 50/50 VUs, 19126 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  0m51.8s/1m40.0s

running (0m53.0s), 50/50 VUs, 19577 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  0m52.8s/1m40.0s

running (0m54.0s), 50/50 VUs, 20038 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  0m53.8s/1m40.0s

running (0m55.0s), 50/50 VUs, 20501 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  0m54.8s/1m40.0s

running (0m56.0s), 50/50 VUs, 20951 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  0m55.8s/1m40.0s

running (0m57.0s), 50/50 VUs, 21419 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  0m56.8s/1m40.0s

running (0m58.0s), 50/50 VUs, 21869 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  0m57.8s/1m40.0s

running (0m59.0s), 50/50 VUs, 22319 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  0m58.8s/1m40.0s

running (1m00.0s), 50/50 VUs, 22787 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  0m59.8s/1m40.0s

running (1m01.0s), 50/50 VUs, 23252 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m00.8s/1m40.0s

running (1m02.0s), 50/50 VUs, 23706 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m01.8s/1m40.0s

running (1m03.0s), 50/50 VUs, 24156 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m02.8s/1m40.0s

running (1m04.0s), 50/50 VUs, 24616 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m03.8s/1m40.0s

running (1m05.0s), 50/50 VUs, 25078 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m04.8s/1m40.0s

running (1m06.0s), 50/50 VUs, 25530 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m05.8s/1m40.0s

running (1m07.0s), 50/50 VUs, 25980 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  1m06.8s/1m40.0s

running (1m08.0s), 50/50 VUs, 26430 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  1m07.8s/1m40.0s

running (1m09.0s), 50/50 VUs, 26894 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  1m08.8s/1m40.0s

running (1m10.0s), 50/50 VUs, 27356 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  1m09.8s/1m40.0s

running (1m11.0s), 50/50 VUs, 27806 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  1m10.8s/1m40.0s

running (1m12.0s), 50/50 VUs, 28257 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  1m11.8s/1m40.0s

running (1m13.0s), 50/50 VUs, 28716 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  1m12.8s/1m40.0s

running (1m14.0s), 50/50 VUs, 29180 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  1m13.8s/1m40.0s

running (1m15.0s), 50/50 VUs, 29643 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  1m14.8s/1m40.0s

running (1m16.0s), 50/50 VUs, 30093 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  1m15.8s/1m40.0s

running (1m17.0s), 50/50 VUs, 30560 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  1m16.8s/1m40.0s

running (1m18.0s), 50/50 VUs, 31016 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  1m17.8s/1m40.0s

running (1m19.0s), 50/50 VUs, 31473 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  1m18.8s/1m40.0s

running (1m20.0s), 50/50 VUs, 31943 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  1m19.8s/1m40.0s

running (1m21.0s), 49/50 VUs, 32390 complete and 0 interrupted iterations
default   [  81% ] 49/50 VUs  1m20.8s/1m40.0s

running (1m22.0s), 46/50 VUs, 32820 complete and 0 interrupted iterations
default   [  82% ] 46/50 VUs  1m21.8s/1m40.0s

running (1m23.0s), 44/50 VUs, 33214 complete and 0 interrupted iterations
default   [  83% ] 44/50 VUs  1m22.8s/1m40.0s

running (1m24.0s), 41/50 VUs, 33614 complete and 0 interrupted iterations
default   [  84% ] 41/50 VUs  1m23.8s/1m40.0s

running (1m25.0s), 38/50 VUs, 33973 complete and 0 interrupted iterations
default   [  85% ] 38/50 VUs  1m24.8s/1m40.0s

running (1m26.0s), 36/50 VUs, 34309 complete and 0 interrupted iterations
default   [  86% ] 36/50 VUs  1m25.8s/1m40.0s

running (1m27.0s), 34/50 VUs, 34623 complete and 0 interrupted iterations
default   [  87% ] 34/50 VUs  1m26.8s/1m40.0s

running (1m28.0s), 31/50 VUs, 34915 complete and 0 interrupted iterations
default   [  88% ] 31/50 VUs  1m27.8s/1m40.0s

running (1m29.0s), 29/50 VUs, 35198 complete and 0 interrupted iterations
default   [  89% ] 29/50 VUs  1m28.8s/1m40.0s

running (1m30.0s), 26/50 VUs, 35444 complete and 0 interrupted iterations
default   [  90% ] 26/50 VUs  1m29.8s/1m40.0s

running (1m31.0s), 24/50 VUs, 35668 complete and 0 interrupted iterations
default   [  91% ] 24/50 VUs  1m30.8s/1m40.0s

running (1m32.0s), 21/50 VUs, 35871 complete and 0 interrupted iterations
default   [  92% ] 21/50 VUs  1m31.8s/1m40.0s

running (1m33.0s), 19/50 VUs, 36050 complete and 0 interrupted iterations
default   [  93% ] 19/50 VUs  1m32.8s/1m40.0s

running (1m34.0s), 16/50 VUs, 36208 complete and 0 interrupted iterations
default   [  94% ] 16/50 VUs  1m33.8s/1m40.0s

running (1m35.0s), 14/50 VUs, 36343 complete and 0 interrupted iterations
default   [  95% ] 14/50 VUs  1m34.8s/1m40.0s

running (1m36.0s), 11/50 VUs, 36459 complete and 0 interrupted iterations
default   [  96% ] 11/50 VUs  1m35.8s/1m40.0s

running (1m37.0s), 09/50 VUs, 36548 complete and 0 interrupted iterations
default   [  97% ] 09/50 VUs  1m36.8s/1m40.0s

running (1m38.0s), 06/50 VUs, 36619 complete and 0 interrupted iterations
default   [  98% ] 06/50 VUs  1m37.8s/1m40.0s

running (1m39.0s), 04/50 VUs, 36663 complete and 0 interrupted iterations
default   [  99% ] 04/50 VUs  1m38.8s/1m40.0s

running (1m40.0s), 01/50 VUs, 36686 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  1m39.8s/1m40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=7.1ms
    ✓ 'p(99)<2000' p(99)=10.9ms

    http_req_failed
    ✓ 'rate<0.2' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 146752  1465.571706/s
    checks_succeeded...: 100.00% 146752 out of 146752
    checks_failed......: 0.00%   0 out of 146752

    ✓ POST shorten status 201
    ✓ POST shorten has code
    ✓ GET redirect status 307
    ✓ GET has location

    HTTP
    http_req_duration..............: avg=3.84ms   min=449.85µs med=3.54ms   max=213.54ms p(90)=5.95ms   p(95)=7.1ms   
      { expected_response:true }...: avg=3.84ms   min=449.85µs med=3.54ms   max=213.54ms p(90)=5.95ms   p(95)=7.1ms   
    http_req_failed................: 0.00% 1 out of 73378
    http_reqs......................: 73378 732.805826/s

    EXECUTION
    iteration_duration.............: avg=109.33ms min=101.95ms med=108.95ms max=316.3ms  p(90)=113.12ms p(95)=114.87ms
    iterations.....................: 36688 366.392926/s
    vus............................: 1     min=1          max=50
    vus_max........................: 50    min=50         max=50

    NETWORK
    data_received..................: 15 MB 146 kB/s
    data_sent......................: 14 MB 144 kB/s



running (1m40.1s), 00/50 VUs, 36688 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m40s